class 캐릭터 {
// 다른 누구도 체력을 바꿀 수없게 숨긴다!
int 레벨;
private int 체력;


// 2. 각각 군인객체를 생성할때는 100
//  탱크 1000 전투기 2000 세팅이 될 수있도록 
캐릭터(int 체력){
// 자식클래스들이 매개변수 받는 생성자한테 체력을 전달할꺼야
this.체력 = 체력;
System.out.println("캐릭터 체력: " + 체력);
}


// 1. 캐릭터들의 체력을 기본적으로 세팅
//	캐릭터(){
// 체력 = 100;
// System.out.println("캐릭터 체력: " + 체력);
//	}

}

// 군인 여러명을 만들어야 된다 그래서 똑같이 만들어야되니깐
// 클래스가 필요하다
// private이 되면 캐릭터라는 클래스에 체력이 상속이 안된다.
// 군인 100
class 군인 extends 캐릭터{

군인() {
// super 부모를 부른다!
super(100);
}
}
// 탱크 1000
class 탱크 extends 캐릭터{
탱크() {
// super 부모를 부른다!
// extends한 부모클래스의 생성자를 불러서 체력을 
// 넘겨준다.
super(1000);
}
}
// 전투기 2000
class 전투기 extends 캐릭터{
전투기() {
// super 부모를 부른다!
super(2000);
}
}


public class SuperTest {

public static void main(String[] args) {

// 문제점은 군인이든 전투기든 탱크든
// 모든 체력이 똑같다라는 점!
// 메인이 야! 이거는 이상하잖아! 그래서 고칠려고 
// 캐릭터라는 클래스가 체력을 안보이게 숨겼거든요!

// private 상속이 안됨!

new 군인();
new 전투기();
new 탱크();





// 게임 캐릭터를 만드는데 캐릭터 클래스 말고 main애가 
// 캐릭터 체력을 변경하면 될까요? 안될까요?
// 캐릭터 전사생성 = new 캐릭터();
// System.out.println("전사의 목숨:" + 전사생성.체력);
//
// main이 목숨을 봤더니 100이라 너무 작다!
// 일반사람이 체력에 접근해서 값을 마음대로 변경한것!
// 치트키?
// 전사생성.체력 = 9999;

// main은 프로그램이 실행하는 곳!
// 각각 클래스에 내용을 변경하는것! 아니다!




}
}