
public class VariableTest {

	public static void main(String[] args) {
		
		// 자바스크립트에서 데이터 저장
		// 알아서 저장되는 값을 보고 타입을 저장한다.
		// 변수
		//  - 값 저장
		// let 공간 이름 = 10;
		
		// 자바는 공간의이름 주는 건 똑같다
		// 자바는 타입을 정해줘야한다.
		// 10이라는 숫자를 저장하는 변수
		
		// 숫자가 두가지가 있으면
		// 소수점이 없는 숫자를 정수(Integer)라고 한다
		int 숫자 = 10;
		System.out.println(숫자);
		//소수점이 있는 숫자 실수(float)
		double 숫자2 = 3.141519;
		System.out.println(숫자2);
		// 문자 여러개
		String 이름 = "에리나";
		System.out.println(이름);
		// 문자 하나
		char 하나 = '*';
		System.out.println(하나);
		
		// 공간의 이름을 지을때
		// 색상이 변하는 검정색,파란색,자두색을
		// 변수명으로 쓰면안된다. (예약어 키워드)
		// 특수문자 전부 안된다. 공백허용 x
		
		//-------------------------------------------------
		// 무조건 소문자 시작해야된다
		// 단어 두개이상 되면 두번째 단어의 첫글자는 대문자 (카펠표기법)
		// helloWorld
		// 숫자로 변수명을 시작하면 안된다.
		
	}

}
